Import NumPy and pandas modules

In [75]:
import numpy as np
import pandas as pd

Creating a DataFrame

In [76]:
from IPython.display import display

# Create and populate a 5x2 NumPy array.
my_data = np.array([[0, 3], [10, 7], [20, 9], [30, 14], [40, 15]])

# Create a Python list that holds the names of the two columns.
my_column_names = ['temperature', 'activity']

# Create a DataFrame.
my_dataframe = pd.DataFrame(data=my_data, columns=my_column_names)

# Print the entire DataFrame
display(my_dataframe)

   temperature  activity
0            0         3
1           10         7
2           20         9
3           30        14
4           40        15

In [77]:
# bu şekilde tablo haline getirmekte mümkün 
temprature=my_data[:,0]
activity=my_data[:,1]
values=[temprature,activity]

table_dic=dict(list(zip(my_column_names,values)))
data=pd.DataFrame(table_dic)
data

   temperature  activity
0            0         3
1           10         7
2           20         9
3           30        14
4           40        15

Adding a new column to a DataFrame

In [78]:
old_table=my_dataframe.copy()
# Create a new column named adjusted.
my_dataframe["adjusted"] = my_dataframe["activity"] + 2

# Print the entire DataFrame
print(my_dataframe)

   temperature  activity  adjusted
0            0         3         5
1           10         7         9
2           20         9        11
3           30        14        16
4           40        15        17

In [79]:
# bu şekilde de dataFrame e kolon ekleyebiliriz  
add_column=pd.DataFrame(data=np.array(my_dataframe["activity"] + 2) ,columns=['adjusted'])

new_table=pd.concat((old_table,add_column),axis=1)
new_table

   temperature  activity  adjusted
0            0         3         5
1           10         7         9
2           20         9        11
3           30        14        16
4           40        15        17

Specifying a subset of a DataFrame

In [87]:

print("Rows #0, #1, and #2:")
display(my_dataframe.head(3), '\n')

print("Row #2:")
display(my_dataframe.iloc[[2,2]], '\n')

print("Rows #1, #2, and #3:")
display(my_dataframe[1:4], '\n')

print("Column 'temperature':")
display(my_dataframe['temperature'])

Rows #0, #1, and #2:

   temperature  activity  adjusted
0            0         3         5
1           10         7         9
2           20         9        11

'\n'

Row #2:

2    11
Name: adjusted, dtype: int32

'\n'

Rows #1, #2, and #3:

   temperature  activity  adjusted
1           10         7         9
2           20         9        11
3           30        14        16

'\n'

Column 'temperature':

0     0
1    10
2    20
3    30
4    40
Name: temperature, dtype: int32

Task 1: Create a DataFrame

In [92]:
datas=np.random.randint(0,100,12).reshape(3,4)
columns=['Eleanor', 'Chidi', 'Tahani','Jason']

df=pd.DataFrame(data=datas,columns=columns)
display(df)
display(df.Eleanor[1])

df['Janet']=df.Tahani + df.Jason
df

   Eleanor  Chidi  Tahani  Jason
0       16     44      46     37
1       69     32      51     30
2       54     13      73     39

69

   Eleanor  Chidi  Tahani  Jason  Janet
0       16     44      46     37     83
1       69     32      51     30     81
2       54     13      73     39    112

Copying a DataFrame (optional)

In [93]:
# Create a reference by assigning my_dataframe to a new variable.
print("Experiment with a reference:")
reference_to_df = df

# Print the starting value of a particular cell.
print("  Starting value of df: %d" % df['Jason'][1])
print("  Starting value of reference_to_df: %d\n" % reference_to_df['Jason'][1])

# Modify a cell in df.
df.at[1, 'Jason'] = df['Jason'][1] + 5
print("  Updated df: %d" % df['Jason'][1])
print("  Updated reference_to_df: %d\n\n" % reference_to_df['Jason'][1])

# Create a true copy of my_dataframe
print("Experiment with a true copy:")
copy_of_my_dataframe = my_dataframe.copy()

# Print the starting value of a particular cell.
print("  Starting value of my_dataframe: %d" % my_dataframe['activity'][1])
print("  Starting value of copy_of_my_dataframe: %d\n" % copy_of_my_dataframe['activity'][1])

# Modify a cell in df.
my_dataframe.at[1, 'activity'] = my_dataframe['activity'][1] + 3
print("  Updated my_dataframe: %d" % my_dataframe['activity'][1])
print("  copy_of_my_dataframe does not get updated: %d" % copy_of_my_dataframe['activity'][1])

Experiment with a reference:
  Starting value of df: 30
  Starting value of reference_to_df: 30

  Updated df: 35
  Updated reference_to_df: 35


Experiment with a true copy:
  Starting value of my_dataframe: 7
  Starting value of copy_of_my_dataframe: 7

  Updated my_dataframe: 10
  copy_of_my_dataframe does not get updated: 7